RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_sysctrl.h
//*****************************************************************************
//
//  am_reg_sysctrl.h
//! @file
//!
//! @brief Register macros for the SYSCTRL module
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2017, Ambiq Micro
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 1.2.11 of the AmbiqSuite Development Package.
//
//*****************************************************************************
#ifndef AM_REG_SYSCTRL_H
#define AM_REG_SYSCTRL_H

//*****************************************************************************
//
// Instance finder. (1 instance(s) available)
//
//*****************************************************************************
#define AM_REG_SYSCTRL_NUM_MODULES                   1
#define AM_REG_SYSCTRLn(n) \
    (REG_SYSCTRL_BASEADDR + 0x00000000 * n)

//*****************************************************************************
//
// Register offsets.
//
//*****************************************************************************
#define AM_REG_SYSCTRL_ICTR_O                        0xE000E004
#define AM_REG_SYSCTRL_ACTLR_O                       0xE000E008
#define AM_REG_SYSCTRL_ICSR_O                        0xE000ED04
#define AM_REG_SYSCTRL_VTOR_O                        0xE000ED08
#define AM_REG_SYSCTRL_AIRCR_O                       0xE000ED0C
#define AM_REG_SYSCTRL_SCR_O                         0xE000ED10
#define AM_REG_SYSCTRL_CCR_O                         0xE000ED14
#define AM_REG_SYSCTRL_SHPR1_O                       0xE000ED18
#define AM_REG_SYSCTRL_SHPR2_O                       0xE000ED1C
#define AM_REG_SYSCTRL_SHPR3_O                       0xE000ED20
#define AM_REG_SYSCTRL_SHCSR_O                       0xE000ED24
#define AM_REG_SYSCTRL_CFSR_O                        0xE000ED28
#define AM_REG_SYSCTRL_HFSR_O                        0xE000ED2C
#define AM_REG_SYSCTRL_MMFAR_O                       0xE000ED34
#define AM_REG_SYSCTRL_BFAR_O                        0xE000ED38
#define AM_REG_SYSCTRL_CPACR_O                       0xE000ED88
#define AM_REG_SYSCTRL_DEMCR_O                       0xE000EDFC
#define AM_REG_SYSCTRL_STIR_O                        0xE000EF00
#define AM_REG_SYSCTRL_FPCCR_O                       0xE000EF34
#define AM_REG_SYSCTRL_FPCAR_O                       0xE000EF38
#define AM_REG_SYSCTRL_FPDSCR_O                      0xE000EF3C

//*****************************************************************************
//
// SYSCTRL_ICTR - Interrupt Controller Type Register (NVIC)
//
//*****************************************************************************
// Total number of interrupt lines in groups of 32.
#define AM_REG_SYSCTRL_ICTR_INTLINESNUM_S            0
#define AM_REG_SYSCTRL_ICTR_INTLINESNUM_M            0x0000000F
#define AM_REG_SYSCTRL_ICTR_INTLINESNUM(n)           (((uint32_t)(n) << 0) & 0x0000000F)

//*****************************************************************************
//
// SYSCTRL_ACTLR - Auxilliary Control Register
//
//*****************************************************************************
// Disables lazy stacking of floating point context.
#define AM_REG_SYSCTRL_ACTLR_DISFPCA_S               9
#define AM_REG_SYSCTRL_ACTLR_DISFPCA_M               0x00000200
#define AM_REG_SYSCTRL_ACTLR_DISFPCA(n)              (((uint32_t)(n) << 9) & 0x00000200)

// Disables floating point instructions completing out of order with respect to
// integer instructions.
#define AM_REG_SYSCTRL_ACTLR_DISOOFP_S               8
#define AM_REG_SYSCTRL_ACTLR_DISOOFP_M               0x00000100
#define AM_REG_SYSCTRL_ACTLR_DISOOFP(n)              (((uint32_t)(n) << 8) & 0x00000100)

// Disables folding of IT instructions.
#define AM_REG_SYSCTRL_ACTLR_DISFOLD_S               2
#define AM_REG_SYSCTRL_ACTLR_DISFOLD_M               0x00000004
#define AM_REG_SYSCTRL_ACTLR_DISFOLD(n)              (((uint32_t)(n) << 2) & 0x00000004)

// Disables write buffer use during default memory map accesses.
#define AM_REG_SYSCTRL_ACTLR_DISDEFWBUF_S            1
#define AM_REG_SYSCTRL_ACTLR_DISDEFWBUF_M            0x00000002
#define AM_REG_SYSCTRL_ACTLR_DISDEFWBUF(n)           (((uint32_t)(n) << 1) & 0x00000002)

// Disables interruption of multi-cycle instructions.
#define AM_REG_SYSCTRL_ACTLR_DISMCYCINT_S            0
#define AM_REG_SYSCTRL_ACTLR_DISMCYCINT_M            0x00000001
#define AM_REG_SYSCTRL_ACTLR_DISMCYCINT(n)           (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// SYSCTRL_ICSR - Interrupt Control and State Register
//
//*****************************************************************************
// Pend an NMI exception.
#define AM_REG_SYSCTRL_ICSR_NMIPENDSET_S             31
#define AM_REG_SYSCTRL_ICSR_NMIPENDSET_M             0x80000000
#define AM_REG_SYSCTRL_ICSR_NMIPENDSET(n)            (((uint32_t)(n) << 31) & 0x80000000)

// Set the PendSV interrupt as pending.
#define AM_REG_SYSCTRL_ICSR_PENDSVSET_S              28
#define AM_REG_SYSCTRL_ICSR_PENDSVSET_M              0x10000000
#define AM_REG_SYSCTRL_ICSR_PENDSVSET(n)             (((uint32_t)(n) << 28) & 0x10000000)

