RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_sysctrl.h
// Reserved for priority of system handler 10.
#define AM_REG_SYSCTRL_SHPR2_PRI_10_S                16
#define AM_REG_SYSCTRL_SHPR2_PRI_10_M                0x00FF0000
#define AM_REG_SYSCTRL_SHPR2_PRI_10(n)               (((uint32_t)(n) << 16) & 0x00FF0000)

// Reserved for priority of system handler 9.
#define AM_REG_SYSCTRL_SHPR2_PRI_9_S                 8
#define AM_REG_SYSCTRL_SHPR2_PRI_9_M                 0x0000FF00
#define AM_REG_SYSCTRL_SHPR2_PRI_9(n)                (((uint32_t)(n) << 8) & 0x0000FF00)

// Reserved for priority of system handler 8.
#define AM_REG_SYSCTRL_SHPR2_PRI_8_S                 0
#define AM_REG_SYSCTRL_SHPR2_PRI_8_M                 0x000000FF
#define AM_REG_SYSCTRL_SHPR2_PRI_8(n)                (((uint32_t)(n) << 0) & 0x000000FF)

//*****************************************************************************
//
// SYSCTRL_SHPR3 - System Handler Priority Register 3.
//
//*****************************************************************************
// Priority of system handler 15, SysTick.
#define AM_REG_SYSCTRL_SHPR3_PRI_15_S                24
#define AM_REG_SYSCTRL_SHPR3_PRI_15_M                0xFF000000
#define AM_REG_SYSCTRL_SHPR3_PRI_15(n)               (((uint32_t)(n) << 24) & 0xFF000000)

// Priority of system handler 14, PendSV.
#define AM_REG_SYSCTRL_SHPR3_PRI_14_S                16
#define AM_REG_SYSCTRL_SHPR3_PRI_14_M                0x00FF0000
#define AM_REG_SYSCTRL_SHPR3_PRI_14(n)               (((uint32_t)(n) << 16) & 0x00FF0000)

// Reserved for priority of system handler 13.
#define AM_REG_SYSCTRL_SHPR3_PRI_13_S                8
#define AM_REG_SYSCTRL_SHPR3_PRI_13_M                0x0000FF00
#define AM_REG_SYSCTRL_SHPR3_PRI_13(n)               (((uint32_t)(n) << 8) & 0x0000FF00)

// Priority of system handler 12, DebugMonitor.
#define AM_REG_SYSCTRL_SHPR3_PRI_12_S                0
#define AM_REG_SYSCTRL_SHPR3_PRI_12_M                0x000000FF
#define AM_REG_SYSCTRL_SHPR3_PRI_12(n)               (((uint32_t)(n) << 0) & 0x000000FF)

//*****************************************************************************
//
// SYSCTRL_SHCSR - System Handler Control and State Register.
//
//*****************************************************************************
// Set to enable UsageFault.
#define AM_REG_SYSCTRL_SHCSR_USAGEFAULTENA_S         18
#define AM_REG_SYSCTRL_SHCSR_USAGEFAULTENA_M         0x00040000
#define AM_REG_SYSCTRL_SHCSR_USAGEFAULTENA(n)        (((uint32_t)(n) << 18) & 0x00040000)

// Set to enable BusFault.
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTENA_S           17
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTENA_M           0x00020000
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTENA(n)          (((uint32_t)(n) << 17) & 0x00020000)

// Set to enable MemManageFault.
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTENA_S           16
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTENA_M           0x00010000
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTENA(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Set to pend the SVCall exception.
#define AM_REG_SYSCTRL_SHCSR_SVCALLPENDED_S          15
#define AM_REG_SYSCTRL_SHCSR_SVCALLPENDED_M          0x00008000
#define AM_REG_SYSCTRL_SHCSR_SVCALLPENDED(n)         (((uint32_t)(n) << 15) & 0x00008000)

// Set to pend the BusFault exception.
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTPENDED_S        14
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTPENDED_M        0x00004000
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTPENDED(n)       (((uint32_t)(n) << 14) & 0x00004000)

// Set to pend the MemManageFault exception.
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTPENDED_S        13
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTPENDED_M        0x00002000
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTPENDED(n)       (((uint32_t)(n) << 13) & 0x00002000)

// Set to pend the UsageFault exception.
#define AM_REG_SYSCTRL_SHCSR_USGFAULTPENDED_S        12
#define AM_REG_SYSCTRL_SHCSR_USGFAULTPENDED_M        0x00001000
#define AM_REG_SYSCTRL_SHCSR_USGFAULTPENDED(n)       (((uint32_t)(n) << 12) & 0x00001000)

// Set when SysTick is active.
#define AM_REG_SYSCTRL_SHCSR_SYSTICKACT_S            11
#define AM_REG_SYSCTRL_SHCSR_SYSTICKACT_M            0x00000800
#define AM_REG_SYSCTRL_SHCSR_SYSTICKACT(n)           (((uint32_t)(n) << 11) & 0x00000800)

// Set when PendSV is active.
#define AM_REG_SYSCTRL_SHCSR_PENDSVACT_S             10
#define AM_REG_SYSCTRL_SHCSR_PENDSVACT_M             0x00000400
#define AM_REG_SYSCTRL_SHCSR_PENDSVACT(n)            (((uint32_t)(n) << 10) & 0x00000400)

// Set when Monitor is active.
#define AM_REG_SYSCTRL_SHCSR_MONITORACT_S            8
#define AM_REG_SYSCTRL_SHCSR_MONITORACT_M            0x00000100
#define AM_REG_SYSCTRL_SHCSR_MONITORACT(n)           (((uint32_t)(n) << 8) & 0x00000100)

// Set when SVCall is active.
#define AM_REG_SYSCTRL_SHCSR_SVCALLACT_S             7
#define AM_REG_SYSCTRL_SHCSR_SVCALLACT_M             0x00000080
#define AM_REG_SYSCTRL_SHCSR_SVCALLACT(n)            (((uint32_t)(n) << 7) & 0x00000080)

// Set when UsageFault is active.
#define AM_REG_SYSCTRL_SHCSR_USGFAULTACT_S           3
#define AM_REG_SYSCTRL_SHCSR_USGFAULTACT_M           0x00000008
#define AM_REG_SYSCTRL_SHCSR_USGFAULTACT(n)          (((uint32_t)(n) << 3) & 0x00000008)

// Set when BusFault is active.
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTACT_S           1
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTACT_M           0x00000002
#define AM_REG_SYSCTRL_SHCSR_BUSFAULTACT(n)          (((uint32_t)(n) << 1) & 0x00000002)

// Set when MemManageFault is active.
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTACT_S           0
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTACT_M           0x00000001
#define AM_REG_SYSCTRL_SHCSR_MEMFAULTACT(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// SYSCTRL_CFSR - Configurable Fault Status Register.
//
//*****************************************************************************
// Divide by zero error has occurred.
#define AM_REG_SYSCTRL_CFSR_DIVBYZERO_S              25
#define AM_REG_SYSCTRL_CFSR_DIVBYZERO_M              0x02000000
#define AM_REG_SYSCTRL_CFSR_DIVBYZERO(n)             (((uint32_t)(n) << 25) & 0x02000000)

// Unaligned access error has occurred.
#define AM_REG_SYSCTRL_CFSR_UNALIGNED_S              24
#define AM_REG_SYSCTRL_CFSR_UNALIGNED_M              0x01000000
#define AM_REG_SYSCTRL_CFSR_UNALIGNED(n)             (((uint32_t)(n) << 24) & 0x01000000)

// A coprocessor access error has occurred.
#define AM_REG_SYSCTRL_CFSR_NOCP_S                   19
#define AM_REG_SYSCTRL_CFSR_NOCP_M                   0x00080000
#define AM_REG_SYSCTRL_CFSR_NOCP(n)                  (((uint32_t)(n) << 19) & 0x00080000)

// An integrity check error has occurred on EXC_RETURN.
#define AM_REG_SYSCTRL_CFSR_INVPC_S                  18
#define AM_REG_SYSCTRL_CFSR_INVPC_M                  0x00040000
#define AM_REG_SYSCTRL_CFSR_INVPC(n)                 (((uint32_t)(n) << 18) & 0x00040000)

// Instruction executed with invalid EPSR.T or EPSR.IT field.
#define AM_REG_SYSCTRL_CFSR_INVSTATE_S               17
#define AM_REG_SYSCTRL_CFSR_INVSTATE_M               0x00020000
#define AM_REG_SYSCTRL_CFSR_INVSTATE(n)              (((uint32_t)(n) << 17) & 0x00020000)

