RT-Thread/rt-thread/bsp/apollo2/libraries/drivers/regs/am_reg_sysctrl.h
// Able to set MemManage exception to pending on last FP stack allocation.
#define AM_REG_SYSCTRL_FPCCR_MMRDY_S                 5
#define AM_REG_SYSCTRL_FPCCR_MMRDY_M                 0x00000020
#define AM_REG_SYSCTRL_FPCCR_MMRDY(n)                (((uint32_t)(n) << 5) & 0x00000020)

// Able to set HardFault exception to pending on last FP stack allocation.
#define AM_REG_SYSCTRL_FPCCR_HFRDY_S                 4
#define AM_REG_SYSCTRL_FPCCR_HFRDY_M                 0x00000010
#define AM_REG_SYSCTRL_FPCCR_HFRDY(n)                (((uint32_t)(n) << 4) & 0x00000010)

// Running from Thread mode on last FP stack allocation.
#define AM_REG_SYSCTRL_FPCCR_THREAD_S                3
#define AM_REG_SYSCTRL_FPCCR_THREAD_M                0x00000008
#define AM_REG_SYSCTRL_FPCCR_THREAD(n)               (((uint32_t)(n) << 3) & 0x00000008)

// Running from unprivileged mode on last FP stack allocation.
#define AM_REG_SYSCTRL_FPCCR_USER_S                  1
#define AM_REG_SYSCTRL_FPCCR_USER_M                  0x00000002
#define AM_REG_SYSCTRL_FPCCR_USER(n)                 (((uint32_t)(n) << 1) & 0x00000002)

// Lazy state preservation is active.
#define AM_REG_SYSCTRL_FPCCR_LSPACT_S                0
#define AM_REG_SYSCTRL_FPCCR_LSPACT_M                0x00000001
#define AM_REG_SYSCTRL_FPCCR_LSPACT(n)               (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// SYSCTRL_FPCAR - Floating-Point Context Address Register.
//
//*****************************************************************************
// Address of the unpopulated floating-point register space allocated on the
// exception stack frame.
#define AM_REG_SYSCTRL_FPCAR_ADDRESS_S               0
#define AM_REG_SYSCTRL_FPCAR_ADDRESS_M               0xFFFFFFFF
#define AM_REG_SYSCTRL_FPCAR_ADDRESS(n)              (((uint32_t)(n) << 0) & 0xFFFFFFFF)

//*****************************************************************************
//
// SYSCTRL_FPDSCR - Floating-Point Default Status Control Register.
//
//*****************************************************************************
// Default value for FPSCR.AHP.
#define AM_REG_SYSCTRL_FPDSCR_AHP_S                  26
#define AM_REG_SYSCTRL_FPDSCR_AHP_M                  0x04000000
#define AM_REG_SYSCTRL_FPDSCR_AHP(n)                 (((uint32_t)(n) << 26) & 0x04000000)

// Default value for FPSCR.DN.
#define AM_REG_SYSCTRL_FPDSCR_DN_S                   25
#define AM_REG_SYSCTRL_FPDSCR_DN_M                   0x02000000
#define AM_REG_SYSCTRL_FPDSCR_DN(n)                  (((uint32_t)(n) << 25) & 0x02000000)

// Default value for FPSCR.FZ.
#define AM_REG_SYSCTRL_FPDSCR_FZ_S                   24
#define AM_REG_SYSCTRL_FPDSCR_FZ_M                   0x01000000
#define AM_REG_SYSCTRL_FPDSCR_FZ(n)                  (((uint32_t)(n) << 24) & 0x01000000)

// Default value for FPSCR.RMode.
#define AM_REG_SYSCTRL_FPDSCR_RMODE_S                22
#define AM_REG_SYSCTRL_FPDSCR_RMODE_M                0x00C00000
#define AM_REG_SYSCTRL_FPDSCR_RMODE(n)               (((uint32_t)(n) << 22) & 0x00C00000)

#endif // AM_REG_SYSCTRL_H
